app/controllers/accounts_controller.rb

    def index
        account= Account.all
---
SELECT "accounts".* FROM "accounts"

    def show
        account= Account.find_by(id: params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        account= Account.create(account_params)
---
INSERT INTO "accounts" ("account_number", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["account_number", 27186], ["balance", 1382], ["created_at", "2023-03-30 19:50:07.899982"], ["updated_at", "2023-03-30 19:50:07.899982"]]

    def destroy
        account= Account.find_by(id: params[:id])
        account.destroy
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]