app/controllers/transactions_controller.rb

    def index
        render json:Transaction.all
---
SELECT "transactions".* FROM "transactions"

    def show
        transaction = Transaction.find_by(id: params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        transaction = Transaction.create(transaction_params)
---
INSERT INTO "transactions" ("transaction_type", "amount", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["transaction_type", nil], ["amount", 21], ["date", nil], ["created_at", "2023-03-31 00:29:19.097721"], ["updated_at", "2023-03-31 00:29:19.097721"]]

    def update
        transaction = Transaction.find_by(id: params[:id])
        transaction.update(transaction_params)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "transactions" SET "transaction_type" = ?, "amount" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["transaction_type", "Automotiv"], ["amount", 2006], ["updated_at", "2023-04-03 00:08:17.031344"], ["id", 1]]

    def destroy
        transaction = Transaction.find_by(id: params[:id])
        transaction.destroy
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 7]]