app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "Brian Maina"], ["email", "bkemboi089@gmail.com"], ["created_at", "2023-04-03 01:02:28.163520"], ["updated_at", "2023-04-03 01:02:28.163520"], ["password_digest", "[FILTERED]"]]
---
  def create
    users = User.create(users_params)